tutorials/VKI-LS89/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 400;

boundaryField
{
    inlet
    {
        type            totalTemperature;
        T0              uniform 420;
        gamma           1.4;
    }

    outlet
    {
        type            inletOutlet;
        value           $internalField;
        inletValue      $internalField;
    }

    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }

    blade
    {
        type            fixedValue;
	value		uniform 301;
    }

    Upper_periodicity
    {
        type            cyclic;
    }

    Lower_periodicity
    {
        type            cyclic;
    }


}


// ************************************************************************* //
