tutorials/VKI-LS89/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (100 0 0);

boundaryField
{
    inlet
    {
        type                     pressureInletOutletVelocity;
        tangentialVelocity       uniform (0 0 0);
        value                    uniform (100 0 0);
    }

    outlet
    {
         type                     pressureInletOutletVelocity;
         tangentialVelocity       uniform (0 0 0);
         value                    uniform (100 0 0);
    }

    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }

    blade
    {
        type            noSlip;
    }

    Upper_periodicity
    {
        type            cyclic;
    }

    Lower_periodicity
    {
        type            cyclic;
    }


}

// ************************************************************************* //
