tutorials/VKI-LS89/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    inlet
    {
        type            totalPressure;
        p0              uniform 160500;
	rho		none;
	psi		thermo:psi;
        gamma           1.4;
        
    }

    outlet
    {
        type            fixedValue;
        value           uniform 82000;
    }

    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }

    blade
    {
        type            zeroGradient;
    }

 Upper_periodicity
    {
        type            cyclic;
    }

    Lower_periodicity
    {
        type            cyclic;
    }

}

// ************************************************************************* //
