tutorials/VKI-LS89/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convectiveFluxScheme
{
    fluxScheme    ROE;
    entropyFixCoeff 0.05;
}

viscousFluxScheme
{
   LaxFriedrichJacobian  true;
}

ddtSchemes
{
    default dualTime rPseudoDeltaT steadyState;
}


gradSchemes
{
    default           Gauss linear;
}

divSchemes
{
    default         none;
    div(tauMC)        Gauss linear;
    div(phi,omega)  Gauss limitedLinear 1;
    div(phi,k)      Gauss limitedLinear 1;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected; 
}

interpolationSchemes
{
    default         linear;

    reconstruct(rho) vanLeer;
    reconstruct(U)   vanLeer;
    reconstruct(T)   vanLeer;
}

snGradSchemes
{
    default          corrected; 
}


wallDist
{
	method meshWave;
}

// ************************************************************************* //
